Repository: ibergis/ibergis.github.io
Catalog: locale/*/LC_MESSAGES/docs/ibergis/for-users/user-manual/ibergis-plugin/dialogs/boundary-cond-manager.po
Languages: es

source: Dialog Boundary conditions manager
es: Diálogo Gestor de condiciones de contorno

source: Tool to manage the boundary conditions of the project.
es: Herramienta para gestionar las condiciones de contorno del proyecto.

source: Window to manage the boundary conditions.
es: Ventana para gestionar las condiciones de contorno.

source: The following buttons are available:
es: Los siguientes botones están disponibles:

source: **Current scenario:** allows, by selecting a scenario, to set it as the current one. All the new boundary conditions established will be stored in the current scenario. The name of the current scenario will be displayed to the left of this button.
es: **Escenario actual:** permite, al seleccionar un escenario, establecerlo como el actual. Todas las nuevas condiciones de contorno establecidas se almacenarán en el escenario actual. El nombre del escenario actual se mostrará a la izquierda de este botón.

source: **Create:** allows to create a new scenario of boundary conditions. We must specify the *idval*, the *Name* and, optionally, a short *Description* of the new scenario.
es: **Crear:** permite crear un nuevo escenario de condiciones de contorno. Debemos especificar el *idval*, el *Nombre* y, opcionalmente, una breve *Descripción* del nuevo escenario.

source: **Duplicate:** allows, by selecting a scenario, to duplicate it. We must specify the *idval*, the *Name* and, optionally, a short *Description* of the new scenario.
es: **Duplicar:** permite, al seleccionar un escenario, duplicarlo. Debemos especificar el *idval*, el *Nombre* y, opcionalmente, una breve *Descripción* del nuevo escenario.

source: **Edit:** allows, by selecting a scenario, edit it.
es: **Editar:** permite, al seleccionar un escenario, editarlo.

source: **Delete:** allows, by selecting a scenario, delete it.
es: **Eliminar:** permite, al seleccionar un escenario, eliminarlo.

source: **Save to mesh:** allows, by selecting a scenario, save the boundary conditions in the mesh. **To use this button, at least one mesh must have been created**.
es: **Guardar en malla:** permite, al seleccionar un escenario, guardar las condiciones de contorno en la malla. **Para usar este botón, se debe haber creado al menos una malla**.
