Repository: ibergis/ibergis.github.io
Catalog: locale/*/LC_MESSAGES/docs/ibergis/for-users/user-manual/ibergis-plugin/dialogs/check-project.po
Languages: es

source: Dialog Check project
es: Diálogo Verificar proyecto

source: Check project.
es: Verificar proyecto.

source: It allows to verify that all elements of the simulation are complete and error-free.
es: Permite verificar que todos los elementos de la simulación están completos y libres de errores.

source: This tool has a checkbox to display only the warnings and errors.
es: Esta herramienta tiene una casilla de verificación para mostrar solo las advertencias y errores.

source: Clicking in *Accept* button will start the check.
es: Al hacer clic en el botón *Aceptar* se iniciará la verificación.

source: Error Management
es: Gestión de Errores

source: The errors can be displayed in two ways:
es: Los errores pueden mostrarse de dos formas:

source: **Log message:** shows an error message on the *Database log* panel.
es: **Mensaje de registro:** muestra un mensaje de error en el panel *Database log*.

source: **Load an error layer:** loads an error layer with the incorrect objects and errors as fields to display the problematic objects on the map.
es: **Cargar capa de errores:** carga una capa de errores con los objetos incorrectos y errores como campos para mostrar los objetos problemáticos en el mapa.

source: All errors are reported as log messages, but there are some errors that create a layer with the problematic objects.
es: Todos los errores se reportan como mensajes de registro, pero hay algunos errores que crean una capa con los objetos problemáticos.

source: There are three types of messages on the *Database log* panel:
es: Hay tres tipos de mensajes en el panel *Database log*:

source: **Info:** the check is completed successfully.
es: **Info:** la verificación se completó con éxito.

source: **Warning:** the check found errors that do not break the simulation.
es: **Advertencia:** la verificación encontró errores que no rompen la simulación.

source: **Error:** the check found errors that most likely will break the simulation.
es: **Error:** la verificación encontró errores que muy probablemente romperán la simulación.
