Repository: ibergis/ibergis.github.io
Catalog: locale/*/LC_MESSAGES/docs/ibergis/for-users/user-manual/ibergis-plugin/dialogs/create-boundary-cond.po
Languages: es

source: Dialog Create boundary conditions
es: Diálogo Crear condiciones de contorno

source: Tool for setting boundary conditions. By clicking on the button we can click on the corresponding lines to set the boundary conditions. Then, a form will appear where we must specify:
es: Herramienta para establecer condiciones de contorno. Al hacer clic en el botón podemos hacer clic en las líneas correspondientes para establecer las condiciones de contorno. Luego, aparecerá un formulario donde debemos especificar:

source: Window to create a new boundary condition - 2D Inlet.
es: Ventana para crear una nueva condición de contorno - Entrada 2D.

source: **ID:** identifier of the boundary condition.
es: **ID:** identificador de la condición de contorno.

source: **Code:** code of the boundary condition.
es: **Código:** código de la condición de contorno.

source: **Descript:** a short description of the boundary condition.
es: **Descripción:** una breve descripción de la condición de contorno.

source: **BC Scenario:** boundary condition scenario in which the new boundary condition will be stored.
es: **Escenario BC:** escenario de condición de contorno en el que se almacenará la nueva condición de contorno.

source: **Bounday Type:** we can select two options:
es: **Tipo de Contorno:** podemos seleccionar dos opciones:

source: *2D Inlet*: we use it to specify an inlet flow. It is necessary to select an option for the inlet (*Total Discharge* or *Water Elevation*) and the inlet condition (*Critical/Subcritical*).
es: *Entrada 2D*: la usamos para especificar un flujo de entrada. Es necesario seleccionar una opción para la entrada (*Descarga Total* o *Elevación de Agua*) y la condición de entrada (*Crítico/Subcrítico*).

source: *2D Outlet*: we use it to specify an outlet flow. You must select the flow condition, either Subcritical or Supercritical/Critical. - If *Subcritical* is selected, you must also define the outlet type (*Weir* or *Given level*) and the crest definition (*Height* or *Elevation*), along with their corresponding values. - If *Supercritical/Critical* is selected, no additional parameters are required, it simply allows the generated flow to leave the model domain.
es: *Salida 2D*: la usamos para especificar un flujo de salida. Debe seleccionar la condición de flujo, ya sea Subcrítico o Supercrítico/Crítico. - Si se selecciona *Subcrítico*, también debe definir el tipo de salida (*Vertedero* o *Nivel dado*) y la definición de cresta (*Altura* o *Elevación*), junto con sus valores correspondientes. - Si se selecciona *Supercrítico/Crítico*, no se requieren parámetros adicionales, simplemente permite que el flujo generado salga del dominio del modelo.

source: **Time Series:** this option allows us to specify an inlet hydrograph. **It is only available when we select 2D inlet option**.
es: **Series Temporales:** esta opción nos permite especificar un hidrograma de entrada. **Solo está disponible cuando seleccionamos la opción de entrada 2D**.

source: The boundary conditions are directly applied to the current scenario. The current scenario can be set on :ref:`dialog-boundary-cond-manager`.
es: Las condiciones de contorno se aplican directamente al escenario actual. El escenario actual puede establecerse en :ref:`dialog-boundary-cond-manager`.

source: Once boundary conditions exist, they can be edited directly by enabling editing through the *Toggle Editing* button, either from the map or the attribute table.
es: Una vez que existen las condiciones de contorno, pueden editarse directamente habilitando la edición a través del botón *Activar edición*, ya sea desde el mapa o la tabla de atributos.
