Repository: ibergis/ibergis.github.io
Catalog: locale/*/LC_MESSAGES/docs/ibergis/for-users/user-manual/ibergis-plugin/dialogs/go2iber-options.po
Languages: es

source: **CN multiplier:** multiplier factor applied to the Curve Number to adjust runoff losses. The default is 1.
es: **Multiplicador CN:** factor multiplicador aplicado al Número de Curva para ajustar las pérdidas de escorrentía. El valor predeterminado es 1.

source: **Ia:** initial abstraction. Storage ratio before the start of flow. The default is 0.2.
es: **Ia:** abstracción inicial. Relación de almacenamiento antes del inicio del flujo. El valor predeterminado es 0.2.

source: Tab IBER RESULTS
es: Pestaña RESULTADOS DE IBER

source: Iber results. In the case of the figure above, the results Depth and Velocity will be displayed.
es: Resultados de Iber. En el caso de la figura anterior, se mostrarán los resultados de Profundidad y Velocidad.

source: Hydrodynamics
es: Hidrodinámica

source: **Depth:** water depth results, in meters, in each mesh cell over time.
es: **Profundidad:** resultados de profundidad del agua, en metros, en cada celda de la malla a lo largo del tiempo.

source: **Velocity:** flow velocity result, in m/s, in each mesh cell over time.
es: **Velocidad:** resultado de velocidad del flujo, en m/s, en cada celda de la malla a lo largo del tiempo.

source: **Specific discharge:** specific discharge result, in m²/s
es: **Caudal específico:** resultado de caudal específico, en m²/s

source: **Water elevation:** total water level result, in meters, the sum of the ground elevation plus the water depth.
es: **Elevación del agua:** resultado del nivel total del agua, en metros, la suma de la elevación del terreno más la profundidad del agua.

source: Maximums
es: Máximos

source: **Maximum depth:** maximum water depth, in meters, reached in each cell during the simulation.
es: **Profundidad máxima:** profundidad máxima del agua, en metros, alcanzada en cada celda durante la simulación.

source: **Maximum velocity:** maximum flow velocity, in m/s, reached in each cell during the simulation.
es: **Velocidad máxima:** velocidad máxima del flujo, en m/s, alcanzada en cada celda durante la simulación.

source: **Maximum specific discharge:** maximum specific flow rate, in m²/s, during the simulation.
es: **Caudal específico máximo:** caudal específico máximo, en m²/s, durante la simulación.

source: **Maximum water elevation:** maximum total water level, in meters, during the simulation.
es: **Elevación máxima del agua:** nivel máximo total del agua, en metros, durante la simulación.

source: Other results
es: Otros resultados

source: **Energy:** represents the total energy of the flow, calculated as the sum of the water level and the kinetic energy.
es: **Energía:** representa la energía total del flujo, calculada como la suma del nivel del agua y la energía cinética.

source: **Froude number:** Froude number indicating the hydraulic flow regime: subcritical (Fr<1), critical (Fr=1) or supercritical (Fr>1).
es: **Número de Froude:** número de Froude que indica el régimen de flujo hidráulico: subcrítico (Fr<1), crítico (Fr=1) o supercrítico (Fr>1).

source: **Local time step:** local time step calculated according to the Courant-Friedrichs-Lewy (CFL) stability condition.
es: **Paso de tiempo local:** paso de tiempo local calculado según la condición de estabilidad de Courant-Friedrichs-Lewy (CFL).

source: **Maximum local time step:** maximum allowable value of the local time step in each model cell, which limits the time increment calculated according to the Courant condition.
es: **Paso de tiempo local máximo:** valor máximo permitido del paso de tiempo local en cada celda del modelo, que limita el incremento de tiempo calculado según la condición de Courant.

source: Hazard
es: Peligrosidad

source: **Hazard RD9/2008:** hydraulic hazard criterion defined by the Spanish Ministry of the Environment, which classifies risk based on water depth and flow velocity.
es: **Peligrosidad RD9/2008:** criterio de peligrosidad hidráulica definido por el Ministerio Español de Medio Ambiente, que clasifica el riesgo basándose en la profundidad del agua y la velocidad del flujo.

source: **Hazard ACA 2003:** hazard criterion of the Catalan Water Agency (2003), which classifies risk zones based on water depth and flow velocity.
es: **Peligrosidad ACA 2003:** criterio de peligrosidad de la Agencia Catalana del Agua (2003), que clasifica zonas de riesgo basándose en la profundidad del agua y la velocidad del flujo.

source: **Pedestrians:** evaluates flow hazards for pedestrians, considering water depth and velocity as determining stability factors (UPC criterion).
es: **Peatones:** evalúa los peligros del flujo para peatones, considerando la profundidad y velocidad del agua como factores determinantes de la estabilidad (criterio UPC).

source: **Vehicles:** evaluates the safety of vehicles against entrainment by currents, based on hydraulic parameters such as water depth and flow velocity (Australian criterion (Shand et al., 2011)).
es: **Vehículos:** evalúa la seguridad de los vehículos contra el arrastre por corrientes, basándose en parámetros hidráulicos como la profundidad del agua y la velocidad del flujo (criterio australiano (Shand et al., 2011)).

source: Raster results
es: Resultados ráster

source: **Raster results:** interpolation method for raster results. The available options are *Linear interpolation* and *Nearest interpolation*. The default is *Linear interpolation*.
es: **Resultados ráster:** método de interpolación para resultados ráster. Las opciones disponibles son *Interpolación lineal* e *Interpolación del vecino más cercano*. El valor predeterminado es *Interpolación lineal*.

source: **Cell size:** cell size of the output rasters, in meters. The default is 100.
es: **Tamaño de celda:** tamaño de celda de los rásters de salida, en metros. El valor predeterminado es 100.

source: **Maximums at the end:** adds one more timestep at the end of the result rasters with the maximum values obtained.
es: **Máximos al final:** añade un paso de tiempo más al final de los rásters de resultado con los valores máximos obtenidos.

source: **Use raster frame:** allows to delimit the geographic area where the raster results will be generated. The parameters are defined in the following group, *Raster results frame*.
es: **Usar marco ráster:** permite delimitar el área geográfica donde se generarán los resultados ráster. Los parámetros se definen en el siguiente grupo, *Marco de resultados ráster*.

source: Raster results frame
es: Marco de resultados ráster

source: Allows to specify the coordinates of the raster boundary.
es: Permite especificar las coordenadas del límite del ráster.

source: Tab IBER PLUGINS
es: Pestaña PLUGINS DE IBER

source: Iber plugins.
es: Plugins de Iber.

source: **Only inlets or complete network:** allows to choose whether to simulate only surface runoff (only inlets) or to include the complete drainage network (complete network). The default is *Complete network*.
es: **Solo entradas o red completa:** permite elegir si simular solo la escorrentía superficial (solo entradas) o incluir la red de drenaje completa (red completa). El valor predeterminado es *Red completa*.

source: **Enable or disable outlet loss:** enables or disables the consideration of energy losses in the model outputs.
es: **Habilitar o deshabilitar pérdida de salida:** habilita o deshabilita la consideración de pérdidas de energía en las salidas del modelo.

source: Tab CHECK PROJECT
es: Pestaña VERIFICAR PROYECTO

source: Check project.
es: Verificar proyecto.

source: Sets maximum and minimum values that can be included or excluded, for parameters: manning, cellsize, sfactor, slope, street_vol, orifice_cd, roughness, mfactor, ufactor, outlet_vol and weir_cd.
es: Establece valores máximos y mínimos que pueden incluirse o excluirse, para parámetros: manning, cellsize, sfactor, slope, street_vol, orifice_cd, roughness, mfactor, ufactor, outlet_vol y weir_cd.

source: Tab RASTER OPTIONS
es: Pestaña OPCIONES DE RÁSTER

source: Raster options.
es: Opciones de ráster.

source: Raster results symbology mode
es: Modo de simbología de resultados ráster

source: Sets the raster results symbology mode. The available options are:
es: Establece el modo de simbología de resultados ráster. Las opciones disponibles son:

source: **Min/Max per band:** automatically adjusts the color scale for each raster band individually using the minimum and maximum values detected within that band.
es: **Mín/Máx por banda:** ajusta automáticamente la escala de color para cada banda ráster individualmente usando los valores mínimo y máximo detectados dentro de esa banda.

source: **Min/Max for all bands:** applies a single color scale to all raster bands, using the overall minimum and maximum values found across every band.
es: **Mín/Máx para todas las bandas:** aplica una sola escala de color a todas las bandas ráster, usando los valores mínimo y máximo globales encontrados en todas las bandas.

source: **Custom Min/Max:** uses custom minimum and maximum values defined in the :ref:`raster-configuration-for-each-layer` for all raster bands.
es: **Mín/Máx personalizado:** usa valores mínimo y máximo personalizados definidos en :ref:`raster-configuration-for-each-layer` para todas las bandas ráster.

source: Raster configuration for each layer
es: Configuración ráster para cada capa

source: Allows to configure the raster results for each layer. The following options are available:
es: Permite configurar los resultados ráster para cada capa. Las siguientes opciones están disponibles:

source: **Maximum and minimum custom values:** sets the maximum and minimum values for the raster results.
es: **Valores personalizados máximo y mínimo:** establece los valores máximo y mínimo para los resultados ráster.

source: **Symbology color ramp:** sets the symbology color ramp.
es: **Rampa de color de simbología:** establece la rampa de color de simbología.

source: **Exclude values for the parameters:** allows you to exclude values to make the configuration easier.
es: **Excluir valores para los parámetros:** permite excluir valores para facilitar la configuración.

source: The available layers to be configured are:
es: Las capas disponibles para configurar son:

source: Depth
es: Profundidad

source: Velocity
es: Velocidad

source: Water Elevation
es: Elevación del Agua

source: Hazard ACA
es: Peligrosidad ACA

source: Severe Hazard RD9-2008
es: Peligrosidad Grave RD9-2008

source: Local Time Step
es: Paso de Tiempo Local

source: Specific Discharge X
es: Caudal Específico X

source: Specific Discharge Y
es: Caudal Específico Y

source: Energy
es: Energía

source: Infiltration Rate
es: Tasa de Infiltración

source: Rain Depth
es: Profundidad de Lluvia

source: Velocity X
es: Velocidad X

source: Velocity Y
es: Velocidad Y

source: Water Performance
es: Rendimiento del Agua

source: Max Depth
es: Profundidad Máxima

source: Max Velocity
es: Velocidad Máxima

source: Max Water Elevation
es: Elevación Máxima del Agua

source: Max Hazard ACA
es: Peligrosidad ACA Máxima

source: Max Severe Hazard RD9-2008
es: Peligrosidad Grave RD9-2008 Máxima

source: Max Local Time Step
es: Paso de Tiempo Local Máximo

source: Max Specific Discharge
es: Caudal Específico Máximo

source: The maximum and minimum configuration will only work with the custom symbology mode.
es: La configuración de máximo y mínimo solo funcionará con el modo de simbología personalizado.

source: The execution can output more rasters than the available to configure on this dialog. They will get imported too, but with default configuration.
es: La ejecución puede generar más rásters que los disponibles para configurar en este diálogo. También se importarán, pero con configuración predeterminada.
