Repository: ibergis/ibergis.github.io
Catalog: locale/*/LC_MESSAGES/docs/ibergis/for-users/user-manual/ibergis-plugin/dialogs/go2iber-options.po
Languages: es

source: Dialog Go2Iber options
es: Diálogo Opciones Go2Iber

source: Tool to manage all the options involved in the simulation. We can manage the SWMM and Iber options.
es: Herramienta para gestionar todas las opciones involucradas en la simulación. Podemos gestionar las opciones de SWMM e Iber.

source: Tab IBERGIS OPTIONS
es: Pestaña OPCIONES DE IBERGIS

source: IBERGIS options.
es: Opciones de IBERGIS.

source: **Project name:** name of the current project.
es: **Nombre del proyecto:** nombre del proyecto actual.

source: **Description:** a short description of the project.
es: **Descripción:** una breve descripción del proyecto.

source: **User:** name of the user or project author.
es: **Usuario:** nombre del usuario o autor del proyecto.

source: **Creation date:** creation date of the project.
es: **Fecha de creación:** fecha de creación del proyecto.

source: **Version:** IberGIS version.
es: **Versión:** versión de IberGIS.

source: Tab SWMM OPTIONS
es: Pestaña OPCIONES DE SWMM

source: SWMM options.
es: Opciones de SWMM.

source: The following options are available:
es: Las siguientes opciones están disponibles:

source: **Skip steady state:** allows to omit the steady phase at the beginning of the hydraulic simulation. The default is NO.
es: **Omitir estado estacionario:** permite omitir la fase estacionaria al comienzo de la simulación hidráulica. El valor predeterminado es NO.

source: **Allow ponding:** determines whether excess water is allowed to collect atop nodes and be re-introduced into the system as conditions permit. The default is YES. In order form ponding to actually occur at a particular node, **a non-zero value for its ponded area attribute must be used** (field *apond* on Junction layer).
es: **Permitir encharcamiento:** determina si se permite que el agua en exceso se acumule sobre los nodos y se reintroduzca en el sistema cuando las condiciones lo permitan. El valor predeterminado es SÍ. Para que el encharcamiento realmente ocurra en un nodo particular, **debe usarse un valor distinto de cero para su atributo de área encharcada** (campo *apond* en la capa Junction).

source: **Min slope:** minimum value allowed for a conduit's slope (%). If zero (the default) then no minimum is imposed (although SWMM uses a lower limit on elevation drop of 0.00035 m when computing a conduit slope).
es: **Pendiente mínima:** valor mínimo permitido para la pendiente de un conducto (%). Si es cero (el valor predeterminado) entonces no se impone ningún mínimo (aunque SWMM usa un límite inferior de caída de elevación de 0.00035 m al calcular la pendiente de un conducto).

source: **Flow units:** allow choice the flow units. The default is CMS.
es: **Unidades de flujo:** permite elegir las unidades de flujo. El valor predeterminado es CMS.

source: **Flow routing:** allow choice which method is used to route flows through the drainage system. The default is DYNWAVE.
es: **Enrutamiento de flujo:** permite elegir qué método se usa para enrutar flujos a través del sistema de drenaje. El valor predeterminado es DYNWAVE.

source: **Link offsets:** determines the convention used to specify the position of a link offset above the invert of its connecting node. DEPTH indicates that offsets are expressed as the distance between the node invert and the link, while ELEVATION indicates that the absolute elevation of the offset is used. The default is ELEVATION.
es: **Desplazamientos de enlace:** determina la convención usada para especificar la posición de un desplazamiento de enlace sobre la cota inferior de su nodo de conexión. DEPTH indica que los desplazamientos se expresan como la distancia entre la cota inferior del nodo y el enlace, mientras que ELEVATION indica que se usa la elevación absoluta del desplazamiento. El valor predeterminado es ELEVATION.

source: **Ignore groundwater:** allow choice if groundwater calculations should be ignored when a project file contains aquifer objects. The default is NO.
es: **Ignorar agua subterránea:** permite elegir si los cálculos de agua subterránea deben ignorarse cuando un archivo de proyecto contiene objetos acuíferos. El valor predeterminado es NO.

source: **Ignore rainfall:** allow choice if all rainfall data and runoff calculations should be ignored. If is set to YES, SWMM only performs flow and pollutant routing based on user-supplied direct and dry weather inflows. The default is NO.
es: **Ignorar precipitación:** permite elegir si todos los datos de precipitación y cálculos de escorrentía deben ignorarse. Si se establece en SÍ, SWMM solo realiza enrutamiento de flujo y contaminantes basado en entradas directas y de clima seco proporcionadas por el usuario. El valor predeterminado es NO.

source: **Ignore routing:** allow choice if only runoff should be computed even if the project contains drainage system links and nodes. The default is NO.
es: **Ignorar enrutamiento:** permite elegir si solo debe calcularse la escorrentía incluso si el proyecto contiene enlaces y nodos del sistema de drenaje. El valor predeterminado es NO.

source: **Ignore snowmelt:** allow choice if snowmelt calculations should be ignored when a project file contains snow pack objects. The default is NO.
es: **Ignorar deshielo:** permite elegir si los cálculos de deshielo deben ignorarse cuando un archivo de proyecto contiene objetos de paquete de nieve. El valor predeterminado es NO.

source: **Ignore quality:** allow choice if pollutant wash off, routing and treatment should be ignored in a project that has pollutants defined. The default is NO.
es: **Ignorar calidad:** permite elegir si el lavado de contaminantes, enrutamiento y tratamiento deben ignorarse en un proyecto que tiene contaminantes definidos. El valor predeterminado es NO.

source: **Force main equation:** establishes wheter the Hazen-Williams (H-W) or the Darcy-Wesbach (D-W) equation will be used to compute friction losses for pressurized flow in conduits that have been assigned a circular force main cross-section shape. The default is H-W.
es: **Ecuación de conducción forzada:** establece si se usará la ecuación de Hazen-Williams (H-W) o la de Darcy-Weisbach (D-W) para calcular las pérdidas por fricción para flujo presurizado en conductos que tienen asignada una forma de sección transversal circular de conducción forzada. El valor predeterminado es H-W.

source: **Inertial damping:** indicates how the inertial terms in the Saint Venant momentum equation will be handled under dynamic wave flow routing. Choosing NONE (the default) maintains these terms at their full value under all conditions. Selecting PARTIAL will reduce the terms as flow comes closer to being critical (and ignores them when flow is supercritical). Choosing FULL will drop the terms altogether.
es: **Amortiguamiento inercial:** indica cómo se manejarán los términos inerciales en la ecuación de momento de Saint Venant bajo enrutamiento de onda dinámica. Elegir NONE (el valor predeterminado) mantiene estos términos en su valor completo bajo todas las condiciones. Seleccionar PARTIAL reducirá los términos a medida que el flujo se acerca a ser crítico (y los ignora cuando el flujo es supercrítico). Elegir FULL eliminará los términos por completo.

source: **Lat flow tol:** maximum percent difference between the current and previous lateral inflow at all nodes in the conveyance system in order for the *Skip steady state* option to take effect. The default is 5 percent.
es: **Tolerancia de flujo lateral:** diferencia porcentual máxima entre la entrada lateral actual y la anterior en todos los nodos del sistema de conducción para que la opción *Omitir estado estacionario* surta efecto. El valor predeterminado es 5 por ciento.

source: **Lengthening step:** time step, in seconds, used to lengthen conduits under dynamic wave routing, so that they meet the Courant stability criterion under full-flow conditions (i.e., the travel time of a wave will not be smaller than the specified conduit lengthening time step). As this value is decreased, fewer conduits will require lengthening. A value of 0 means that no conduits will be lengthened. The default is 1.
es: **Paso de alargamiento:** paso de tiempo, en segundos, usado para alargar conductos bajo enrutamiento de onda dinámica, de modo que cumplan el criterio de estabilidad de Courant bajo condiciones de flujo completo (es decir, el tiempo de viaje de una onda no será menor que el paso de tiempo de alargamiento de conducto especificado). A medida que este valor disminuye, menos conductos requerirán alargamiento. Un valor de 0 significa que no se alargarán conductos. El valor predeterminado es 1.

source: **Wet step:** time step length used to compute runoff from subcatchments during periods of rainfall or when ponded water still remains on the surface. The default is 00:05:00.
es: **Paso húmedo:** longitud de paso de tiempo usada para calcular la escorrentía de subcuencas durante períodos de lluvia o cuando el agua encharcada aún permanece en la superficie. El valor predeterminado es 00:05:00.

source: **Sweep start:** day of the year (month/day) when street sweeping operations begin. The default is 01/01.
es: **Inicio de barrido:** día del año (mes/día) cuando comienzan las operaciones de barrido de calles. El valor predeterminado es 01/01.

source: **Sweep end:** day of the year (month/day) when street sweeping operations end. The default is 12/31.
es: **Fin de barrido:** día del año (mes/día) cuando terminan las operaciones de barrido de calles. El valor predeterminado es 12/31.

source: **Variable step:** safety factor applied to a variable time step computed for each time period under dynamic wave flow routing. The variable time step is computed so as to satisfy the Courant stability criterion for each conduit and yet not exceed the *Routing step* value. If the safety factor is 0, then no variable time step is used. The default is 0.75.
es: **Paso variable:** factor de seguridad aplicado a un paso de tiempo variable calculado para cada período de tiempo bajo enrutamiento de onda dinámica. El paso de tiempo variable se calcula para satisfacer el criterio de estabilidad de Courant para cada conducto y aún así no exceder el valor de *Paso de enrutamiento*. Si el factor de seguridad es 0, entonces no se usa paso de tiempo variable. El valor predeterminado es 0.75.

source: **Normal flow limited:** specifies which condition is checked to determine if flow in a conduit is supercritical and should thus be limited to the normal flow. Use SLOPE to check if the water surface slope is greater than the conduit slope, FROUDE to check if the Froude number is greater than 1 or BOTH to check both conditions. The default is BOTH.
es: **Flujo normal limitado:** especifica qué condición se verifica para determinar si el flujo en un conducto es supercrítico y por lo tanto debe limitarse al flujo normal. Use SLOPE para verificar si la pendiente de la superficie del agua es mayor que la pendiente del conducto, FROUDE para verificar si el número de Froude es mayor que 1 o BOTH para verificar ambas condiciones. El valor predeterminado es BOTH.

source: **Min surfarea:** minimum surface area used at nodes when computing changes in water depth under dynamic wave routing. If 0 is entered, then the default value of 1.167 m² is used (i.e., the area of a 1,2192 m diameter manhole).
es: **Área superficial mínima:** área superficial mínima usada en los nodos al calcular cambios en la profundidad del agua bajo enrutamiento de onda dinámica. Si se ingresa 0, entonces se usa el valor predeterminado de 1.167 m² (es decir, el área de un pozo de inspección de 1,2192 m de diámetro).

source: **Dry days:** number of days with no rainfall prior to the start of the simulation. The default is 10.
es: **Días secos:** número de días sin lluvia antes del inicio de la simulación. El valor predeterminado es 10.

source: **Dry step:** time step length used for runoff computations (consisting essentially of pollutant buildup) during periods when there is no rainfall and no ponded water. The default is 1:00:00.
es: **Paso seco:** longitud de paso de tiempo usada para cálculos de escorrentía (que consiste esencialmente en acumulación de contaminantes) durante períodos cuando no hay lluvia ni agua encharcada. El valor predeterminado es 1:00:00.

source: **Head tolerance:** difference in computed head at each node between successive trials below which the flow solution for the current time step is assumed to have converged. The default tolerance is 0.
es: **Tolerancia de carga:** diferencia en la carga calculada en cada nodo entre intentos sucesivos por debajo de la cual se asume que la solución de flujo para el paso de tiempo actual ha convergido. La tolerancia predeterminada es 0.

source: **Max trials:** maximum number of trials allowed during a time step to reach convergence when updating hydraulic heads at the conveyance system's nodes. The default value is 0.
es: **Intentos máximos:** número máximo de intentos permitidos durante un paso de tiempo para alcanzar convergencia al actualizar las cargas hidráulicas en los nodos del sistema de conducción. El valor predeterminado es 0.

source: **Sys flow tol:** maximum percent difference between total system inflow and total system outflow which can occur in order for the *Skip steady state* option to take effect. The default is 5 percent.
es: **Tolerancia de flujo del sistema:** diferencia porcentual máxima entre la entrada total del sistema y la salida total del sistema que puede ocurrir para que la opción *Omitir estado estacionario* surta efecto. El valor predeterminado es 5 por ciento.

source: **Threads:** number of parallel computing threads to use for dynamic wave flow routing on machines equipped with multi-core processors. The default is 1.
es: **Hilos:** número de hilos de computación paralela a usar para enrutamiento de flujo de onda dinámica en máquinas equipadas con procesadores multinúcleo. El valor predeterminado es 1.

source: **Minimum step:** the smallest time step allowed when variable time steps are used for dynamic wave flow routing. The default is 0.5.
es: **Paso mínimo:** el paso de tiempo más pequeño permitido cuando se usan pasos de tiempo variables para enrutamiento de flujo de onda dinámica. El valor predeterminado es 0.5.

source: **Routing step:** time step length in seconds used for routing flows and water quality constituents through the conveyance system. This can be increased if dynamic wave routing is not used. The default is 00:00:02.
es: **Paso de enrutamiento:** longitud de paso de tiempo en segundos usada para enrutar flujos y constituyentes de calidad del agua a través del sistema de conducción. Esto puede aumentarse si no se usa enrutamiento de onda dinámica. El valor predeterminado es 00:00:02.

source: **Start date:** the date when the simulation begins. If not supplied, a date of 01/01/2017 is used.
es: **Fecha de inicio:** la fecha cuando comienza la simulación. Si no se proporciona, se usa la fecha 01/01/2017.

source: **End date:** the date when the simulation is to end. The default is the start date.
es: **Fecha de fin:** la fecha cuando debe terminar la simulación. El valor predeterminado es la fecha de inicio.

source: **Report start date:** the date when reporting of results is to begin. The default is the simulations start date.
es: **Fecha de inicio de informe:** la fecha cuando debe comenzar el informe de resultados. El valor predeterminado es la fecha de inicio de la simulación.

source: **Report step:** time interval for reporting of computed results. The default is 00:05:00.
es: **Paso de informe:** intervalo de tiempo para informar resultados calculados. El valor predeterminado es 00:05:00.

source: **Start time:** time of day on the starting date when the simulation begins. The default is 00:00:00.
es: **Hora de inicio:** hora del día en la fecha de inicio cuando comienza la simulación. El valor predeterminado es 00:00:00.

source: **End time:** time of day on the ending date when the simulation will end. The default is 03:00:00.
es: **Hora de fin:** hora del día en la fecha de finalización cuando terminará la simulación. El valor predeterminado es 03:00:00.

source: **Report start time:** time of day on the report starting date when reporting is to begin. The default is the simulation start time of day.
es: **Hora de inicio de informe:** hora del día en la fecha de inicio del informe cuando debe comenzar el informe. El valor predeterminado es la hora de inicio de la simulación.

source: Tab SWMM RESULTS
es: Pestaña RESULTADOS DE SWMM

source: SWMM results.
es: Resultados de SWMM.

source: **Continuity:** specifies if continuity checks should be reported or not. The default is YES.
es: **Continuidad:** especifica si las verificaciones de continuidad deben reportarse o no. El valor predeterminado es SÍ.

source: **Flowstats:** specifies whether summary flow statistics should be reported or not. The default is YES.
es: **Estadísticas de flujo:** especifica si las estadísticas resumidas de flujo deben reportarse o no. El valor predeterminado es SÍ.

source: **Controls:** specifies whether all control actions taken during a simulation should be listed or not. The default is YES.
es: **Controles:** especifica si todas las acciones de control tomadas durante una simulación deben listarse o no. El valor predeterminado es SÍ.

source: **Input:** specifies whether or not a summary of the input data should be provided in the output report. The default is NO.
es: **Entrada:** especifica si debe proporcionarse o no un resumen de los datos de entrada en el informe de salida. El valor predeterminado es NO.

source: **Timestep detailed subcatchments:** list of subcatchments whose results are to be reported. The default is blank.
es: **Subcuencas detalladas por paso de tiempo:** lista de subcuencas cuyos resultados deben reportarse. El valor predeterminado está en blanco.

source: **Timestep detailed nodes I and II:** list of nodes whose results are to be reported. The default is blank. A maximum of 40 nodes can be written in each of them.
es: **Nodos detallados por paso de tiempo I y II:** lista de nodos cuyos resultados deben reportarse. El valor predeterminado está en blanco. Se puede escribir un máximo de 40 nodos en cada uno de ellos.

source: **Timestep detailed links:** list of links whose results are to be reported. The default is blank.
es: **Enlaces detallados por paso de tiempo:** lista de enlaces cuyos resultados deben reportarse. El valor predeterminado está en blanco.

source: Tab IBER OPTIONS
es: Pestaña OPCIONES DE IBER

source: Iber options.
es: Opciones de Iber.

source: Numerical scheme
es: Esquema numérico

source: **Numerical scheme:** defines the numerical scheme for the Saint-Venant equations used in calculating surface flow. Available options are *1st Order*, *2nd Order*, *DHD* and *DHD Basin*. The default is *DHD*.
es: **Esquema numérico:** define el esquema numérico para las ecuaciones de Saint-Venant usadas en el cálculo del flujo superficial. Las opciones disponibles son *1er Orden*, *2do Orden*, *DHD* y *DHD Basin*. El valor predeterminado es *DHD*.

source: **CFL:** Courant-Friedrichs-Lewy condition. The user must set the value. If a very high value is set, the computation time will be reduced, but convergence issues may arise in the solution of the equations. A value of 0.45 can be considered appropriate as a starting point, and it can be lowered to 0.3 if convergence problems are observed.
es: **CFL:** condición de Courant-Friedrichs-Lewy. El usuario debe establecer el valor. Si se establece un valor muy alto, el tiempo de cálculo se reducirá, pero pueden surgir problemas de convergencia en la solución de las ecuaciones. Un valor de 0.45 puede considerarse apropiado como punto de partida, y puede reducirse a 0.3 si se observan problemas de convergencia.

source: **Max time increment:** sets the maximum value of the time step used by the program to integrate the flow equations. This is a maximum value. In practice, the time step used during the simulation will be the minimum between this value and the one computed based on the CFL condition. The default is 1.
es: **Incremento de tiempo máximo:** establece el valor máximo del paso de tiempo usado por el programa para integrar las ecuaciones de flujo. Este es un valor máximo. En la práctica, el paso de tiempo usado durante la simulación será el mínimo entre este valor y el calculado basándose en la condición CFL. El valor predeterminado es 1.

source: **Wet-dry limit:** this is the depth threshold above which an element is considered wet. Below this value, the element is considered dry, and therefore no computations are performed on it, unless it becomes wet. While in river engineering, a threshold of 0.01 m is generally reasonable, in some cases this value could be reduced to as little as 0.001 m. The default is 0.0001.
es: **Límite húmedo-seco:** este es el umbral de profundidad por encima del cual un elemento se considera húmedo. Por debajo de este valor, el elemento se considera seco, y por lo tanto no se realizan cálculos en él, a menos que se moje. Mientras que en ingeniería de ríos, un umbral de 0.01 m es generalmente razonable, en algunos casos este valor podría reducirse hasta 0.001 m. El valor predeterminado es 0.0001.

source: **Molecular viscosity:** molecular viscosity coefficient applied to the flow to represent numerical diffusion effects. The default is 0.000001.
es: **Viscosidad molecular:** coeficiente de viscosidad molecular aplicado al flujo para representar efectos de difusión numérica. El valor predeterminado es 0.000001.

source: DHD and DHD Basin schemes must not be used for hydraulic simulations
es: Los esquemas DHD y DHD Basin no deben usarse para simulaciones hidráulicas

source: Time & Simulation control
es: Control de Tiempo y Simulación

source: **Results 2D time interval:** time interval, in seconds, that defines how often a 2D result is saved during the simulation. This must match the *Report step* value. The default is 300.
es: **Intervalo de tiempo de resultados 2D:** intervalo de tiempo, en segundos, que define cada cuánto se guarda un resultado 2D durante la simulación. Esto debe coincidir con el valor de *Paso de informe*. El valor predeterminado es 300.

source: **Timeseries time interval:** time interval, in seconds, between data records in the time series. If not defined or greater than the *Result 2D time interval*, we use that value. The default is 300.
es: **Intervalo de tiempo de series temporales:** intervalo de tiempo, en segundos, entre registros de datos en las series temporales. Si no está definido o es mayor que el *Intervalo de tiempo de resultado 2D*, se usa ese valor. El valor predeterminado es 300.

source: Hydrological processes
es: Procesos hidrológicos

source: **Start time:** simulation start time, in seconds. The default is 0.
es: **Tiempo de inicio:** tiempo de inicio de la simulación, en segundos. El valor predeterminado es 0.

source: **Precipitation:** selects the type of precipitation applied in the model. The available options are *Hyetograph*, *Raster* and *No rain*. The default is *No rain*.
es: **Precipitación:** selecciona el tipo de precipitación aplicada en el modelo. Las opciones disponibles son *Hietograma*, *Ráster* y *Sin lluvia*. El valor predeterminado es *Sin lluvia*.

source: **Set rainfall raster:** allows to choose between the defined precipitation rasters.
es: **Establecer ráster de precipitación:** permite elegir entre los rásters de precipitación definidos.

source: **Losses method:** method used to calculate infiltration losses. The default is *SCS*.
es: **Método de pérdidas:** método usado para calcular pérdidas por infiltración. El valor predeterminado es *SCS*.
