Repository: ibergis/ibergis.github.io
Catalog: locale/*/LC_MESSAGES/docs/ibergis/for-users/user-manual/ibergis-plugin/dialogs/mesh-manager.po
Languages: es

source: Dialog Mesh manager
es: Diálogo Gestor de mallas

source: Tool for incorporating the mesh into the model. Having a mesh is not only essential for the calculations to be done, since it defines the calculation elements; but is also the one getting the values of the distributed parameters of the model trough its net, such as land uses or curve number for the infiltration model. The mesh can be created or directly imported. The different scenarios created for diverse boundary conditions must be also saved to a existing mesh.
es: Herramienta para incorporar la malla al modelo. Tener una malla no solo es esencial para que se realicen los cálculos, ya que define los elementos de cálculo; sino que también es la que obtiene los valores de los parámetros distribuidos del modelo a través de su red, como usos del suelo o número de curva para el modelo de infiltración. La malla puede crearse o importarse directamente. Los diferentes escenarios creados para diversas condiciones de contorno también deben guardarse en una malla existente.

source: Mesh manager.
es: Gestor de mallas.

source: The following buttons are available:
es: Los siguientes botones están disponibles:

source: **Create:** allows to create a new mesh (see :ref:`dialog-create-mesh`).
es: **Crear:** permite crear una nueva malla (ver :ref:`dialog-create-mesh`).

source: **View:** allows, by selecting a mesh, see it in the ToC.
es: **Ver:** permite, al seleccionar una malla, verla en el ToC.

source: **Import:** allows to import a mesh from computer files.
es: **Importar:** permite importar una malla desde archivos del ordenador.

source: **Export:** allows to export a mesh.
es: **Exportar:** permite exportar una malla.

source: **Delete:** allows, by selecting a mesh, delete it.
es: **Eliminar:** permite, al seleccionar una malla, eliminarla.

source: Dialog Create Mesh
es: Diálogo Crear Malla

source: Dialog Create Mesh.
es: Diálogo Crear Malla.

source: Tool for creating a new mesh. The following options are available:
es: Herramienta para crear una nueva malla. Las siguientes opciones están disponibles:

source: **Input data:** checks to perform on layers to detect errors and allows to use selected features only.
es: **Datos de entrada:** comprobaciones a realizar en las capas para detectar errores y permite usar solo las entidades seleccionadas.

source: **Transitions:** allows the user to configure the mesh transition settings, which control how smoothly the mesh resolution decreases from the breaklines toward the interior of the domain. To this aim, the *Enable fine-tuned transitions* must be active. In this case, the user can define the value of the transition slope, the distance in which the transition begins, and the transition extent.
es: **Transiciones:** permite al usuario configurar los ajustes de transición de malla, que controlan qué tan suavemente disminuye la resolución de la malla desde las líneas de quiebre hacia el interior del dominio. Para este propósito, la opción *Habilitar transiciones ajustadas* debe estar activa. En este caso, el usuario puede definir el valor de la pendiente de transición, la distancia en la que comienza la transición y la extensión de la transición.

source: **Boundary conditions:** allows to apply the boundary conditions of the current scenario to the mesh.
es: **Condiciones de contorno:** permite aplicar las condiciones de contorno del escenario actual a la malla.

source: **Elevation:** DEM layer to obtain elevations.
es: **Elevación:** capa DEM para obtener elevaciones.

source: **Roughness:** layer to obtain roughness values (Manning's coefficient).
es: **Rugosidad:** capa para obtener valores de rugosidad (coeficiente de Manning).

source: **Losses:** layer to obtain loss values (Curve Number).
es: **Pérdidas:** capa para obtener valores de pérdida (Número de Curva).

source: **Mesh options:** this field allows to save the mesh with a specific name. This name will later help you identify the mesh you want to work with when assigning the boundary conditions scenario.
es: **Opciones de malla:** este campo permite guardar la malla con un nombre específico. Este nombre le ayudará posteriormente a identificar la malla con la que desea trabajar al asignar el escenario de condiciones de contorno.
