Repository: ibergis/ibergis.github.io
Catalog: locale/*/LC_MESSAGES/docs/ibergis/for-users/user-manual/ibergis-plugin/dialogs/non-visual-obj.po
Languages: es

source: Dialog Non visual objects
es: Diálogo Objetos no visuales

source: Tool to manage the non visual objects of the project.
es: Herramienta para gestionar los objetos no visuales del proyecto.

source: Window to manage the non visual objects.
es: Ventana para gestionar los objetos no visuales.

source: We can manage curves, patterns, timeseries, controls and rasters. In all cases, the following buttons are available:
es: Podemos gestionar curvas, patrones, series temporales, controles y rásters. En todos los casos, los siguientes botones están disponibles:

source: **Duplicate:** allows to duplicate a selected object.
es: **Duplicar:** permite duplicar un objeto seleccionado.

source: **Create:** allows to create a new object.
es: **Crear:** permite crear un nuevo objeto.

source: **Delete:** allows to delete a selected object.
es: **Eliminar:** permite eliminar un objeto seleccionado.

source: This window is used to create and configure non-visual objects. These elements are stored in the model and can be selectively activated depending on the requirements of each simulation.
es: Esta ventana se utiliza para crear y configurar objetos no visuales. Estos elementos se almacenan en el modelo y pueden activarse selectivamente dependiendo de los requisitos de cada simulación.

source: Curves
es: Curvas

source: Allows to define curves of control, diversion, pump, rating, shape, storage or tidal type.
es: Permite definir curvas de tipo control, desviación, bomba, clasificación, forma, almacenamiento o mareal.

source: Window to create or edit a curve.
es: Ventana para crear o editar una curva.

source: To create a curve we will have to specify pairs of values until the curve is defined. Depending on the type of curve, several pairs of values may be necessary.
es: Para crear una curva tendremos que especificar pares de valores hasta que la curva esté definida. Dependiendo del tipo de curva, pueden ser necesarios varios pares de valores.

source: Patterns
es: Patrones

source: Allows to define temporal patterns that we can assign to certain network objects.
es: Permite definir patrones temporales que podemos asignar a ciertos objetos de la red.

source: Window to create or edit a pattern.
es: Ventana para crear o editar un patrón.

source: We can create daily, hourly, monthly or weekend patterns.
es: Podemos crear patrones diarios, horarios, mensuales o de fin de semana.

source: Timeseries
es: Series Temporales

source: Window to create or edit a time series.
es: Ventana para crear o editar una serie temporal.

source: Allows to define different types of time series:
es: Permite definir diferentes tipos de series temporales:

source: **BC elevation:** boundary condition to set a specific water surface elevation.
es: **Elevación BC:** condición de contorno para establecer una elevación específica de la superficie del agua.

source: **BC flow:** boundary condition to set a specific flow.
es: **Flujo BC:** condición de contorno para establecer un flujo específico.

source: **Evaporation:** a time series of evaporation rates can be loaded to account for water loss due to this factor during long hydrological simulations.
es: **Evaporación:** se puede cargar una serie temporal de tasas de evaporación para contabilizar la pérdida de agua debido a este factor durante simulaciones hidrológicas prolongadas.

source: **Inflow hydrograph:** boundary condition used to define a specific inflow over time using a hydrograph (discharge vs time). This allows modeling variable flow entering the domain.
es: **Hidrograma de entrada:** condición de contorno utilizada para definir una entrada específica a lo largo del tiempo usando un hidrograma (descarga vs tiempo). Esto permite modelar flujo variable que entra al dominio.

source: **Orifice:**
es: **Orificio:**

source: **Rainfall:** allows the user to define a hyetograph to be used in the model. Each hyetograph is associated with specific spatial coordinates and its location can be manually adjusted using the vertex editor, by toggling the editing mode in QGIS and dragging the point to the desired location. - If only one hyetograph is provided, the entire domain will receive homogeneous rainfall based on that hyetograph. - If multiple hyetographs are loaded, rainfall distribution across the domain will be interpolated using Thiessen polygons.
es: **Precipitación:** permite al usuario definir un hietograma para usarse en el modelo. Cada hietograma está asociado con coordenadas espaciales específicas y su ubicación puede ajustarse manualmente usando el editor de vértices, activando el modo de edición en QGIS y arrastrando el punto a la ubicación deseada. - Si solo se proporciona un hietograma, todo el dominio recibirá precipitación homogénea basada en ese hietograma. - Si se cargan múltiples hietogramas, la distribución de precipitación en el dominio se interpolará usando polígonos de Thiessen.

source: **Temperature:** a time series of temperature can be loaded.
es: **Temperatura:** se puede cargar una serie temporal de temperatura.

source: Except for the *BC ELEVATION* option, in all other cases the data can be defined either manually (using relative or absolute times) or by importing it from an external file.
es: Excepto para la opción *BC ELEVATION*, en todos los demás casos los datos pueden definirse manualmente (usando tiempos relativos o absolutos) o importándolos desde un archivo externo.

source: To assign any of the previously defined time series to the model, you must specify the location or geometry where the series will be applied. This can be done through the attribute table by toggling the editing mode and selecting the relevant geometry. The attribute table displays one row for each geometry or location in the domain. To assign the appropriate time series to each location, activate the editing mode and use the drop-down menu in the "timeseries" column to choose from the predefined time series.
es: Para asignar cualquiera de las series temporales previamente definidas al modelo, debe especificar la ubicación o geometría donde se aplicará la serie. Esto puede hacerse a través de la tabla de atributos activando el modo de edición y seleccionando la geometría relevante. La tabla de atributos muestra una fila para cada geometría o ubicación en el dominio. Para asignar la serie temporal apropiada a cada ubicación, active el modo de edición y use el menú desplegable en la columna "timeseries" para elegir entre las series temporales predefinidas.

source: Hyetograph attribute table.
es: Tabla de atributos del hietograma.

source: Controls
es: Controles

source: Orders or instructions that determine how the network works over time.
es: Órdenes o instrucciones que determinan cómo funciona la red a lo largo del tiempo.

source: Window to create or edit a control.
es: Ventana para crear o editar un control.

source: Rasters
es: Rásters

source: Window to manage the raster objects.
es: Ventana para gestionar los objetos ráster.

source: They integrate spatial data to represent variability of parameters such as precipitation.
es: Integran datos espaciales para representar la variabilidad de parámetros como la precipitación.

source: These rasters may represent either rainfall volume (mm) or rainfall intensity (mm/h). The user must specify the type of data contained in the rasters, as well as the corresponding timestamp for each file to ensure correct temporal assignment during the simulation.
es: Estos rásters pueden representar ya sea volumen de precipitación (mm) o intensidad de precipitación (mm/h). El usuario debe especificar el tipo de datos contenidos en los rásters, así como la marca de tiempo correspondiente para cada archivo para asegurar la asignación temporal correcta durante la simulación.

source: Rasters can be imported with the import button on the manager.
es: Los rásters pueden importarse con el botón de importación en el gestor.

source: Window to create or edit a raster.
es: Ventana para crear o editar un ráster.

source: The non-visual objects must be assigned to their corresponding locations (geometries) in the model via their respective attribute tables.
es: Los objetos no visuales deben asignarse a sus ubicaciones correspondientes (geometrías) en el modelo a través de sus respectivas tablas de atributos.
