Repository: ibergis/ibergis.github.io
Catalog: locale/*/LC_MESSAGES/docs/ibergis/for-users/user-manual/ibergis-plugin/dialogs/results.po
Languages: es

source: Dialog Results
es: Diálogo Resultados

source: Tool to work with the simulation results.
es: Herramienta para trabajar con los resultados de la simulación.

source: Window to manage the simulation results.
es: Ventana para gestionar los resultados de la simulación.

source: We can manage profile, report summary, time series graph, load raster results, load vector results and set results folder.
es: Podemos gestionar perfil, resumen de informe, gráfico de series temporales, cargar resultados ráster, cargar resultados vectoriales y establecer carpeta de resultados.

source: Profile
es: Perfil

source: Draws the profile, the longitudinal section between two or more nodes.
es: Dibuja el perfil, la sección longitudinal entre dos o más nodos.

source: Dialog Create Profile.
es: Diálogo Crear Perfil.

source: The following options are available:
es: Las siguientes opciones están disponibles:

source: **Profile:** allows to select the initial and final nodes of the profile.
es: **Perfil:** permite seleccionar los nodos inicial y final del perfil.

source: **Parameters:** allows to select parameters like mode or offsets. The available options are:
es: **Parámetros:** permite seleccionar parámetros como modo o desplazamientos. Las opciones disponibles son:

source: **Mode:** allows to select the mode of the profile. The available modes are: *Dry* and *With water*.
es: **Modo:** permite seleccionar el modo del perfil. Los modos disponibles son: *Seco* y *Con agua*.

source: **Offsets:** allows to select the offsets of the profile. The available offsets are: *Depth* and *Elevation*.
es: **Desplazamientos:** permite seleccionar los desplazamientos del perfil. Los desplazamientos disponibles son: *Profundidad* y *Elevación*.

source: **Timestamp:** allows to select the timestamp of the profile. There is the option to select an instant or a period.
es: **Marca de tiempo:** permite seleccionar la marca de tiempo del perfil. Existe la opción de seleccionar un instante o un período.

source: The *Timestamp* options will only work in *With water* mode.
es: Las opciones de *Marca de tiempo* solo funcionarán en modo *Con agua*.

source: After clicking on the *Draw profile* button, a new dialog will be opened with the profile.
es: Después de hacer clic en el botón *Dibujar perfil*, se abrirá un nuevo diálogo con el perfil.

source: This dialog has many options to improve the visualization of the profile, like zoom or customization of the colors.
es: Este diálogo tiene muchas opciones para mejorar la visualización del perfil, como zoom o personalización de los colores.

source: Dialog Profile.
es: Diálogo Perfil.

source: The *Dry* mode gets the data form the project GeoPackage, while the *With water* mode gets the data form the results folder.
es: El modo *Seco* obtiene los datos del GeoPackage del proyecto, mientras que el modo *Con agua* obtiene los datos de la carpeta de resultados.

source: Report summary
es: Resumen de informe

source: Provides the maximum values of the results, in a table.
es: Proporciona los valores máximos de los resultados, en una tabla.

source: Dialog Report Summary.
es: Diálogo Resumen de Informe.

source: Time series graph
es: Gráfico de series temporales

source: Allows to visualize how flow, precipitation or water levels vary at specific points in the model.
es: Permite visualizar cómo varían el flujo, la precipitación o los niveles de agua en puntos específicos del modelo.

source: Dialog Create Time Series Graph.
es: Diálogo Crear Gráfico de Series Temporales.

source: **Time Periods:** allows to select the time periods to be displayed.
es: **Períodos de Tiempo:** permite seleccionar los períodos de tiempo a mostrar.

source: **Plot Configuration:** allows to configure the plot configuration.
es: **Configuración del Gráfico:** permite configurar la configuración del gráfico.

source: **Data Series:** allows to add, remove and select the objects to be displayed.
es: **Series de Datos:** permite añadir, eliminar y seleccionar los objetos a mostrar.

source: **Data Series Selection:** allows to select the objects from the canvas and their variable to be displayed.
es: **Selección de Series de Datos:** permite seleccionar los objetos del lienzo y su variable a mostrar.

source: This tool allows to save and load the graph configuration with the *Save* and *Load* buttons.
es: Esta herramienta permite guardar y cargar la configuración del gráfico con los botones *Guardar* y *Cargar*.

source: After clicking on the *Show graph* button, a new dialog will be opened with the graph.
es: Después de hacer clic en el botón *Mostrar gráfico*, se abrirá un nuevo diálogo con el gráfico.

source: This dialog have many options to improve the visualization of the graph, like zoom or customization of the colors.
es: Este diálogo tiene muchas opciones para mejorar la visualización del gráfico, como zoom o personalización de los colores.

source: Dialog Time Series Graph.
es: Diálogo Gráfico de Series Temporales.

source: Load raster results
es: Cargar resultados ráster

source: Allows to load simulation results in raster format.
es: Permite cargar resultados de simulación en formato ráster.

source: Dialog Load Raster Results.
es: Diálogo Cargar Resultados Ráster.

source: Load vector results
es: Cargar resultados vectoriales

source: Loads the maximum values obtained by the 1D model, in layer format with an specific style for each layer.
es: Carga los valores máximos obtenidos por el modelo 1D, en formato de capa con un estilo específico para cada capa.

source: Vector Results Layers.
es: Capas de Resultados Vectoriales.

source: Set results folder
es: Establecer carpeta de resultados

source: Sets the folder where the results are stored.
es: Establece la carpeta donde se almacenan los resultados.
