Repository: ibergis/ibergis.github.io
Catalog: locale/*/LC_MESSAGES/docs/ibergis/for-users/user-manual/ibergis-plugin/ibergis-plugin.po
Languages: es

source: IberGIS Plugin
es: Plugin de IberGIS

source: The IberGIS plugin is an essential tool for integrated water cycle management.
es: El plugin de IberGIS es una herramienta esencial para la gestión integrada del ciclo del agua.

source: It has two toolbars: *Main* and *Utilities*.
es: Tiene dos barras de herramientas: *Principal* y *Utilidades*.

source: Toolbar *Main*
es: Barra de herramientas *Principal*

source: Toolbar *Main*.
es: Barra de herramientas *Principal*.

source: This toolbar contains the following buttons:
es: Esta barra de herramientas contiene los siguientes botones:

source: **Import INP:** allows you to import an inp file. For more details, see the section :ref:`dialog-import-inp`.
es: **Importar INP:** permite importar un archivo inp. Para más detalles, consulte la sección :ref:`dialog-import-inp`.

source: **Boundary conditions manager:** allows you to manage the boundary conditions. For more details, see the section :ref:`dialog-boundary-cond-manager`.
es: **Gestor de condiciones de contorno:** permite gestionar las condiciones de contorno. Para más detalles, consulte la sección :ref:`dialog-boundary-cond-manager`.

source: **Create boundary condition:** allows you to create boundary conditions. For more details, see the section :ref:`dialog-create-boundary-cond`.
es: **Crear condición de contorno:** permite crear condiciones de contorno. Para más detalles, consulte la sección :ref:`dialog-create-boundary-cond`.

source: **Non visual objects manager:** allows you to manage the non visual objects of the project. For more details, see the section :ref:`dialog-non-visual-obj`.
es: **Gestor de objetos no visuales:** permite gestionar los objetos no visuales del proyecto. Para más detalles, consulte la sección :ref:`dialog-non-visual-obj`.

source: **Bridge actions:** allows you to add or edit a bridge. For more details, see the section :ref:`dialog-bridge-actions`.
es: **Acciones de puente:** permite añadir o editar un puente. Para más detalles, consulte la sección :ref:`dialog-bridge-actions`.

source: Toolbar *Utilities*
es: Barra de herramientas *Utilidades*

source: Toolbar *Utilities*.
es: Barra de herramientas *Utilidades*.

source: **Options:** allows you to manage all SWMM and Iber options in one place. For more details, see the section :ref:`dialog-go2iber-options`.
es: **Opciones:** permite gestionar todas las opciones de SWMM e Iber en un solo lugar. Para más detalles, consulte la sección :ref:`dialog-go2iber-options`.

source: **Generate INP:** allows you to export the network to an inp file. For more details, see the section :ref:`dialog-generate-inp`.
es: **Generar INP:** permite exportar la red a un archivo inp. Para más detalles, consulte la sección :ref:`dialog-generate-inp`.

source: **Mesh manager:** allows you to manage the meshes of the project. For more details, see the section :ref:`dialog-mesh-manager`.
es: **Gestor de mallas:** permite gestionar las mallas del proyecto. Para más detalles, consulte la sección :ref:`dialog-mesh-manager`.

source: **Execute model:** allows you to execute the model to simulate the network. For more details, see the section :ref:`dialog-execute-model`.
es: **Ejecutar modelo:** permite ejecutar el modelo para simular la red. Para más detalles, consulte la sección :ref:`dialog-execute-model`.

source: **Results:** contains many tools for working with the simulation results. For more details, see the section :ref:`dialog-results`.
es: **Resultados:** contiene muchas herramientas para trabajar con los resultados de la simulación. Para más detalles, consulte la sección :ref:`dialog-results`.

source: **Check project:** allows you to check the project in order to find errors. For more details, see the section :ref:`dialog-check-project`.
es: **Verificar proyecto:** permite verificar el proyecto para encontrar errores. Para más detalles, consulte la sección :ref:`dialog-check-project`.
