Repository: ibergis/ibergis.github.io
Catalog: locale/*/LC_MESSAGES/docs/ibergis/for-users/user-manual/ibergis-toolbox.po
Languages: es

source: IberGIS toolbox
es: Caja de herramientas de IberGIS

source: The toolbox is the set of IberGIS tools that allows to import, debug and validate project layers to run hydraulic simulations.
es: La caja de herramientas es el conjunto de herramientas de IberGIS que permite importar, depurar y validar capas de proyecto para ejecutar simulaciones hidráulicas.

source: IberGIS toolbox.
es: Caja de herramientas de IberGIS.

source: To run a process, simply double-click on its name in the toolbox.
es: Para ejecutar un proceso, simplemente haga doble clic en su nombre en la caja de herramientas.

source: Process dialog box
es: Cuadro de diálogo de proceso

source: After double-clicking on the process, a dialog box similar to the one shown in the following figure will open.
es: Después de hacer doble clic en el proceso, se abrirá un cuadro de diálogo similar al mostrado en la siguiente figura.

source: Dialog of Import Ground Geometries.
es: Diálogo de Importar Geometrías de Terreno.

source: The dialog show two tabs on the left (Config and Info log), the description of the process on the right and a set of buttons.
es: El diálogo muestra dos pestañas a la izquierda (Config e Infolog), la descripción del proceso a la derecha y un conjunto de botones.

source: Tab *Config*
es: Pestaña *Config*

source: In this tab, we must establish the input values that the process needs to be executed, as well as the configuration parameters that must be specified.
es: En esta pestaña, debemos establecer los valores de entrada que el proceso necesita para ser ejecutado, así como los parámetros de configuración que deben ser especificados.

source: The input values will depend on the process being executed, so the dialog box will be different for each process.
es: Los valores de entrada dependerán del proceso que se esté ejecutando, por lo que el cuadro de diálogo será diferente para cada proceso.

source: Tab *Info log*
es: Pestaña *Info log*

source: It shows a summary of the process that has been carried out.
es: Muestra un resumen del proceso que se ha llevado a cabo.

source: Example of a process summary.
es: Ejemplo de un resumen de proceso.

source: Process results
es: Resultados del proceso

source: The execution of certain processes involves the creation of temporary layers with the results. These layers will be loaded into the ToC in a group and their geometry will depend on the geometry of the input layer.
es: La ejecución de ciertos procesos implica la creación de capas temporales con los resultados. Estas capas se cargarán en la ToC en un grupo y su geometría dependerá de la geometría de la capa de entrada.
