Repository: ibergis/ibergis.github.io
Catalog: locale/*/LC_MESSAGES/docs/ibergis/for-users/user-manual/toc.po
Languages: es

source: Table of Contents (ToC)
es: Tabla de Contenidos (ToC)

source: The following layer groups are organized by default in the table of contents (ToC) of an IberGIS project:
es: Los siguientes grupos de capas se organizan por defecto en la tabla de contenidos (ToC) de un proyecto IberGIS:

source: Layers automatically generated during the model validation and correction processes. They are not saved in the GeoPackage.
es: Capas generadas automáticamente durante los procesos de validación y corrección del modelo. No se guardan en el GeoPackage.

source: INPUT
es: ENTRADA

source: Groups all the model's input data.
es: Agrupa todos los datos de entrada del modelo.

source: **SWMM:** objects imported from the drainage network's INP file (dwf, inflow, junction, divider, outfall, storage, conduit, pump, orifice, weir and outlet), an their symbology.
es: **SWMM:** objetos importados desde el archivo INP de la red de drenaje (dwf, inflow, junction, divider, outfall, storage, conduit, pump, orifice, weir and outlet), y su simbología.

source: **IBER:** hydraulic elements required for 2D surface calculations, including inlets, pinlets, hyetographs, boundary conditions, bridges, culverts, and inlet connections to the network.
es: **IBER:** elementos hidráulicos requeridos para cálculos de superficie 2D, incluyendo inlets, pinlets, hyetographs, boundary conditions, bridges, culverts, y inlets conectados a la red.

source: **MESH:** ground and roof layers, along with mesh anchor lines and mesh anchor points.
es: **MALLA:** capas de suelo y techo, junto con líneas de anclaje de malla y puntos de anclaje de malla.

source: BASE MAP
es: MAPA BASE

source: Reference map loaded by default in the project.
es: Mapa de referencia cargado por defecto en el proyecto.

source: Layers in table of contents.
es: Capas en la tabla de contenidos.
