Repository: ibergis/ibergis.github.io
Catalog: locale/*/LC_MESSAGES/docs/ibergis/for-developers/developer-manual/dbmodel.po
Languages: es

source: DB Model
es: Modelo de Base de Datos

source: This section describes the database model structure and organization used by IberGIS.
es: Esta sección describe la estructura y organización del modelo de base de datos utilizado por IberGIS.

source: Data File Format
es: Formato de Archivo de Datos

source: IberGIS uses **GeoPackage (GPKG)** files as the primary data storage format. GeoPackage is an open, standards-based, platform-independent, portable, self-describing, compact format for transferring geospatial information. It is based on SQLite 3 database engine and supports both vector features and raster data.
es: IberGIS utiliza archivos **GeoPackage (GPKG)** como formato principal de almacenamiento de datos. GeoPackage es un formato abierto, basado en estándares, independiente de plataforma, portátil, autodescriptivo y compacto para transferir información geoespacial. Está basado en el motor de base de datos SQLite 3 y soporta tanto características vectoriales como datos ráster.

source: The main project files created by IberGIS have the ``.gpkg`` extension and contain all the necessary tables, spatial data, configurations, and metadata for hydraulic modeling projects.
es: Los archivos de proyecto principales creados por IberGIS tienen la extensión ``.gpkg`` y contienen todas las tablas necesarias, datos espaciales, configuraciones y metadatos para proyectos de modelado hidráulico.

source: Database Schema Organization
es: Organización del Esquema de Base de Datos

source: The database schema is organized in the ``dbmodel/`` directory within the plugin installation folder. The structure follows a modular approach, separating different aspects of the database into logical components.
es: El esquema de base de datos está organizado en el directorio ``dbmodel/`` dentro de la carpeta de instalación del plugin. La estructura sigue un enfoque modular, separando diferentes aspectos de la base de datos en componentes lógicos.

source: SQL Files Structure
es: Estructura de Archivos SQL

source: The database model is defined through multiple SQL files organized in subdirectories.
es: El modelo de base de datos se define mediante múltiples archivos SQL organizados en subdirectorios.

source: DDL (Data Definition Language)
es: DDL (Lenguaje de Definición de Datos)

source: Located in ``dbmodel/ddl/ddl.sql``.
es: Ubicado en ``dbmodel/ddl/ddl.sql``.

source: This file contains all the table definitions, including:
es: Este archivo contiene todas las definiciones de tablas, incluyendo:

source: **Configuration tables:** Store plugin parameters and user configurations.
es: **Tablas de configuración:** Almacenan parámetros del plugin y configuraciones de usuario.

source: **Catalog tables:** Define available types and categories for various elements (boundary scenarios, materials, curves, etc.).
es: **Tablas de catálogo:** Definen tipos y categorías disponibles para varios elementos (escenarios de contorno, materiales, curvas, etc.).

source: **Feature tables:** Store the main hydraulic and geometric elements.
es: **Tablas de entidades:** Almacenan los principales elementos hidráulicos y geométricos.

source: **System tables:** Manage internal plugin operations and form configurations.
es: **Tablas de sistema:** Gestionan operaciones internas del plugin y configuraciones de formularios.

source: **Geometry tables:** Store spatial features for grounds, roofs, inlets, conduits, nodes, and other elements.
es: **Tablas de geometría:** Almacenan entidades espaciales para terrenos, techos, entradas, conductos, nodos y otros elementos.

source: All tables include SQLite type checking constraints to ensure data integrity.
es: Todas las tablas incluyen restricciones de verificación de tipo de SQLite para garantizar la integridad de datos.

source: DML (Data Manipulation Language)
es: DML (Lenguaje de Manipulación de Datos)

source: Located in ``dbmodel/dml/dml.sql``.
es: Ubicado en ``dbmodel/dml/dml.sql``.

source: This file contains the initial data population statements:
es: Este archivo contiene las sentencias de población de datos inicial:

source: **Spatial reference system (SRID) configuration:** Sets up the coordinate reference system.
es: **Configuración del sistema de referencia espacial (SRID):** Configura el sistema de referencia de coordenadas.

source: **System tables initialization:** Populates configuration and metadata tables.
es: **Inicialización de tablas de sistema:** Puebla las tablas de configuración y metadatos.

source: **Catalog data:** Inserts default values for all catalog tables.
es: **Datos de catálogo:** Inserta valores predeterminados para todas las tablas de catálogo.

source: **Form field definitions:** Configures the dynamic forms used throughout the plugin.
es: **Definiciones de campos de formulario:** Configura los formularios dinámicos utilizados en todo el plugin.

source: **Type values:** Populates dropdown lists and selectable options.
es: **Valores de tipo:** Puebla listas desplegables y opciones seleccionables.

source: The DML file uses placeholders like ``<SRID_VALUE>`` that are dynamically replaced when creating new projects.
es: El archivo DML usa marcadores de posición como ``<SRID_VALUE>`` que se reemplazan dinámicamente al crear nuevos proyectos.

source: Triggers
es: Disparadores

source: Located in ``dbmodel/trg/``.
es: Ubicado en ``dbmodel/trg/``.

source: **trg_create.sql:** Contains CREATE triggers that:
es: **trg_create.sql:** Contiene disparadores CREATE que:

source: Auto-generate unique codes for new elements (e.g., 'J1', 'C5', 'RF10').
es: Generan automáticamente códigos únicos para elementos nuevos (por ejemplo, 'J1', 'C5', 'RF10').

source: Maintain topology relationships between nodes and arcs.
es: Mantienen relaciones topológicas entre nodos y arcos.

source: Update parent-child table relationships.
es: Actualizan relaciones de tabla padre-hijo.

source: Synchronize geometry changes across related tables.
es: Sincronizan cambios de geometría en tablas relacionadas.

source: **trg_delete.sql:** Contains DELETE triggers that:
es: **trg_delete.sql:** Contiene disparadores DELETE que:

source: Cascade deletions to related tables.
es: Propagan eliminaciones en cascada a tablas relacionadas.

source: Clean up orphaned records.
es: Limpian registros huérfanos.

source: Maintain referential integrity.
es: Mantienen la integridad referencial.

source: Functions
es: Funciones

source: Located in ``dbmodel/fct/``.
es: Ubicado en ``dbmodel/fct/``.

source: **fct_after_import_ground_geometries.sql:** Post-processing for ground polygon imports.
es: **fct_after_import_ground_geometries.sql:** Post-procesamiento para importaciones de polígonos de terreno.

source: **fct_after_import_inlet_geometries.sql:** Post-processing for inlet point imports.
es: **fct_after_import_inlet_geometries.sql:** Post-procesamiento para importaciones de puntos de entrada.

source: **fct_after_import_roof_geometries.sql:** Post-processing for roof polygon imports.
es: **fct_after_import_roof_geometries.sql:** Post-procesamiento para importaciones de polígonos de techo.

source: **fct_after_import_inp.sql:** Post-processing after importing EPA SWMM .inp files.
es: **fct_after_import_inp.sql:** Post-procesamiento después de importar archivos EPA SWMM .inp.

source: These functions handle data normalization, code assignments, and relationship establishment after bulk imports.
es: Estas funciones manejan la normalización de datos, asignaciones de código y establecimiento de relaciones después de importaciones masivas.

source: Internationalization (i18n)
es: Internacionalización (i18n)

source: Located in ``dbmodel/i18n/``.
es: Ubicado en ``dbmodel/i18n/``.

source: Contains language-specific DML files for multiple locales:
es: Contiene archivos DML específicos de idioma para múltiples localizaciones:

source: **en_US/dml.sql:** English (United States).
es: **en_US/dml.sql:** Inglés (Estados Unidos).

source: **es_ES/dml.sql:** Spanish (Spain).
es: **es_ES/dml.sql:** Español (España).

source: **es_CR/dml.sql:** Spanish (Costa Rica).
es: **es_CR/dml.sql:** Español (Costa Rica).

source: These files provide translated values for user-facing strings stored in the database, such as field labels, tooltips, and messages.
es: Estos archivos proporcionan valores traducidos para cadenas de cara al usuario almacenadas en la base de datos, como etiquetas de campos, información sobre herramientas y mensajes.

source: Reports Database
es: Base de Datos de Informes

source: Located in ``dbmodel/rpt_gpkg/``.
es: Ubicado en ``dbmodel/rpt_gpkg/``.

source: Defines a separate schema for storing simulation results:
es: Define un esquema separado para almacenar resultados de simulación:

source: **ddl.sql:** Tables for storing EPA SWMM simulation results (nodes, arcs, flow summaries, etc.).
es: **ddl.sql:** Tablas para almacenar resultados de simulación EPA SWMM (nodos, arcos, resúmenes de flujo, etc.).

source: **dml.sql:** Initial configuration for result tables.
es: **dml.sql:** Configuración inicial para tablas de resultados.

source: The reports database structure allows IberGIS to import and visualize simulation outputs directly in QGIS.
es: La estructura de base de datos de informes permite a IberGIS importar y visualizar salidas de simulación directamente en QGIS.

source: System Tables
es: Tablas de Sistema

source: Located in ``dbmodel/sys_gpkg/sys_gpkg.sql``.
es: Ubicado en ``dbmodel/sys_gpkg/sys_gpkg.sql``.

source: Creates system-level tables required by GeoPackage and GDAL/OGR:
es: Crea tablas de nivel de sistema requeridas por GeoPackage y GDAL/OGR:

source: **gpkg_ogr_contents:** Tracks feature counts for each table.
es: **gpkg_ogr_contents:** Rastrea recuentos de entidades para cada tabla.

source: Additional metadata tables for GeoPackage compliance.
es: Tablas de metadatos adicionales para cumplimiento de GeoPackage.

source: Example Data
es: Datos de Ejemplo

source: Located in ``dbmodel/example/example_data.sql``.
es: Ubicado en ``dbmodel/example/example_data.sql``.

source: Provides sample data for testing and demonstration purposes, including:
es: Proporciona datos de muestra para propósitos de prueba y demostración, incluyendo:

source: Boundary conditions with geometries.
es: Condiciones de contorno con geometrías.

source: Sample ground, roof, and inlet features.
es: Entidades de muestra de terreno, techo y entrada.

source: Pre-configured scenarios.
es: Escenarios preconfigurados.

source: Example hyetographs and time series.
es: Hietogramas y series temporales de ejemplo.

source: Database Initialization
es: Inicialización de Base de Datos

source: The file ``dbmodel/init.sql`` serves as the entry point for database creation. It references and executes all other SQL files in the correct order to build a complete project database.
es: El archivo ``dbmodel/init.sql`` sirve como punto de entrada para la creación de la base de datos. Hace referencia y ejecuta todos los demás archivos SQL en el orden correcto para construir una base de datos de proyecto completa.

source: The typical initialization sequence is:
es: La secuencia de inicialización típica es:

source: Create system GeoPackage tables.
es: Crear tablas de sistema GeoPackage.

source: Execute DDL to create all tables.
es: Ejecutar DDL para crear todas las tablas.

source: Execute DML to populate initial data.
es: Ejecutar DML para poblar datos iniciales.

source: Apply internationalization for the selected language.
es: Aplicar internacionalización para el idioma seleccionado.

source: Create triggers for data integrity.
es: Crear disparadores para integridad de datos.

source: Load example data (if creating a sample project).
es: Cargar datos de ejemplo (si se crea un proyecto de muestra).

source: Version Control and Updates
es: Control de Versiones y Actualizaciones

source: Located in ``dbmodel/updates/``.
es: Ubicado en ``dbmodel/updates/``.

source: The plugin includes a versioning system organized by major/minor/patch numbers:
es: El plugin incluye un sistema de versionado organizado por números mayor/menor/parche:

source: **updates/1/1/0/:** Contains update scripts for version 1.1.0.
es: **updates/1/1/0/:** Contiene scripts de actualización para la versión 1.1.0.

source: **changelog.txt:** Describes changes in this version.
es: **changelog.txt:** Describe los cambios en esta versión.

source: **ddl.sql:** Schema modifications.
es: **ddl.sql:** Modificaciones de esquema.

source: **dml.sql:** Data migrations.
es: **dml.sql:** Migraciones de datos.

source: This structure allows IberGIS to automatically upgrade existing project databases when users update the plugin to a newer version.
es: Esta estructura permite a IberGIS actualizar automáticamente las bases de datos de proyectos existentes cuando los usuarios actualizan el plugin a una versión más reciente.

source: Updates must also be applied to the base files for new projects. For example, if version 1.1.0 introduces a new table, you must update ``dbmodel/ddl/ddl.sql`` to include the new table definition in addition to updating ``dbmodel/updates/1/1/0/ddl.sql``.
es: Las actualizaciones también deben aplicarse a los archivos base para proyectos nuevos. Por ejemplo, si la versión 1.1.0 introduce una nueva tabla, debe actualizar ``dbmodel/ddl/ddl.sql`` para incluir la nueva definición de tabla además de actualizar ``dbmodel/updates/1/1/0/ddl.sql``.

source: Key Features
es: Características Clave

source: Type Checking
es: Verificación de Tipo

source: All tables use SQLite's ``typeof()`` function in CHECK constraints to enforce strict type validation, preventing data corruption from incorrect value types.
es: Todas las tablas usan la función ``typeof()`` de SQLite en restricciones CHECK para aplicar validación de tipo estricta, previniendo corrupción de datos por tipos de valor incorrectos.

source: Spatial Data
es: Datos Espaciales

source: Geometric features use the GeoPackage geometry type and are registered in the standard ``gpkg_geometry_columns`` table. Supported geometry types include:
es: Las entidades geométricas usan el tipo de geometría GeoPackage y se registran en la tabla estándar ``gpkg_geometry_columns``. Los tipos de geometría admitidos incluyen:

source: POINT (inlets, junctions, storage, outfalls, dividers, hyetographs).
es: POINT (entradas, uniones, almacenamiento, desagües, divisores, hietogramas).

source: LINESTRING (conduits, orifices, weirs, pumps, outlets).
es: LINESTRING (conductos, orificios, vertederos, bombas, salidas).

source: POLYGON (grounds, roofs).
es: POLYGON (terrenos, techos).

source: MULTILINESTRING (boundary conditions).
es: MULTILINESTRING (condiciones de contorno).

source: Foreign Keys
es: Claves Foráneas

source: The database extensively uses foreign key constraints to maintain referential integrity between related tables. Cascading updates and restricted deletions ensure data consistency.
es: La base de datos usa extensivamente restricciones de clave foránea para mantener la integridad referencial entre tablas relacionadas. Las actualizaciones en cascada y las eliminaciones restringidas aseguran la consistencia de datos.

source: JSON Fields
es: Campos JSON

source: Some configuration tables use JSON-formatted TEXT fields to store complex structured data, such as form widget parameters and additional metadata.
es: Algunas tablas de configuración usan campos TEXT formateados JSON para almacenar datos estructurados complejos, como parámetros de widgets de formulario y metadatos adicionales.
