Repository: ibergis/ibergis.github.io
Catalog: locale/*/LC_MESSAGES/docs/index.po
Languages: es

source: IberGIS User Manual
es: Manual de Usuario de IberGIS

source: FOR USERS
es: PARA USUARIOS

source: IberGIS Developer Manual
es: Manual de Desarrollador de IberGIS

source: FOR DEVELOPERS
es: PARA DESARROLLADORES

source: Administrator Documentation
es: Documentación para Administradores

source: FOR ADMINISTRATORS
es: PARA ADMINISTRADORES

source: IberGIS Documentation |version|
es: Documentación de IberGIS |version|

source: IberGIS documentation is available in multiple languages and versions. Expand the :guilabel:`IberGIS Documentation` menu at the bottom of the sidebar to see the list.
es: La documentación de IberGIS está disponible en múltiples idiomas y versiones. Expanda el menú :guilabel:`IberGIS Documentation` en la parte inferior de la barra lateral para ver la lista.

source: Welcome to the official documentation for `IberGIS <https://www.iberaula.es/>`_, an optimized and personalized guide for using IberGIS in your organization. Fast, dynamic, and built to adapt to your needs, this documentation is structured to give you the best experience as you navigate IberGIS features.
es: Bienvenido a la documentación oficial de `IberGIS <https://www.iberaula.es/>`_, una guía optimizada y personalizada para usar IberGIS en su organización. Rápida, dinámica y construida para adaptarse a sus necesidades, esta documentación está estructurada para brindarle la mejor experiencia mientras navega por las funcionalidades de IberGIS.

source: Welcome to IberGIS, the first free software aimed at integrated water cycle management (supply and sanitation).
es: Bienvenido a IberGIS, el primer software libre orientado a la gestión integrada del ciclo del agua (abastecimiento y saneamiento).

source: Submit a report or pull request in the `GitHub repository <https://github.com/ibergis/ibergis.github.io/>`_,
es: Envíe un informe o solicitud de cambios (pull request) en el `repositorio de GitHub <https://github.com/ibergis/ibergis.github.io/>`_,

source: Please take a look at one of the documents below.
es: Por favor, eche un vistazo a uno de los documentos a continuación.
